# SketchOverconstrainedWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..SketchOverconstrainedWarn Property
BuiltInFailures..::..SketchFailures Class See Also
---
Sketch is overconstrained.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SketchOverconstrainedWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SketchOverconstrainedWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SketchOverconstrainedWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace